{
    "locales": {
        "en": "Anglais",
        "fr": "Français"
    },

    "legal": {
        "terms": "Mentions légales"
    },

    "navigation": {
        "home": "Accueil",
        "skills": "Compétences",
        "education": "Parcours",
        "experiences": "Expériences",
        "gallery": "Réalisations",
        "contact": "Contact"
    },

    "resources": {
        "repositories": "Dépôts",
        "resources": "Ressources",
        "archives": "Archives"
    },

    "header": {
        "logo": "Logo"
    },

    "footer": {
        "banner": "Bannière",
        "legal": "Légal",
        "navigation": "Navigation",
        "resources": "Ressources",
        "location": "Où me trouver"
    },

    "copyright": {
        "content": "Copyright © 2024 Agon KOLGECI • Tous droits réservés",
        "details": "Fait avec Next.js et Tailwind CSS, deployée avec Vercel depuis GitHub."
    },

    "global": {
        "title": "Agon KOLGECI",
        "description": "Passionné depuis mon plus jeune âge par l'informatique, je consacre mon temps à réaliser divers projets me permettant d'enrichir mes connaissances.",
        "keywords": "Agon KOLGECI, Développeur de logiciels, Développeur passionné, Enthousiaste de l'informatique, Projets logiciels, Enrichissement des connaissances, Expert en codage, Portfolio de développeur, Passionné de technologie, Projets de programmation, Codeur compétent, Informatique, Compétences en développement, Logiciels innovants, Projets personnels, Passion pour la technologie, Jeune développeur, Auto-apprentissage, Professionnel de l'informatique, Projets technologiques"
    },

    "home": {
        "title": "Agon KOLGECI",
        "description": "Développeur en logiciels",

        "about": {
            "title": "À propos de moi",
            "description": "Découvrez qui je suis, mes passions, et le parcours qui m'a façonné. Apprenez-en plus sur mon expérience, mes centres d'intérêt et ce qui me pousse à exceller dans tout ce que je fais.",

            "presentation": "Salut, je suis Agon KOLGECI, un jeune développeur en logiciels et actuellement en études de Sciences Informatiques. Depuis mon plus jeune âge, j'ai pu découvrir, apprendre et expérimenter diverses technologies en autodidacte, ce qui m'a permis de développer une véritable passion pour l'informatique et d'acquérir diverses compétences dans ce domaine. Toutes ces expériences m'ont motivé à poursuivre mes études dans ce domaine afin d'approfondir mes connaissances et devenir un expert capable de créer des solutions innovantes. Aujourd'hui je suis déterminé à continuer sur cette voie et à me perfectionner chaque jour pour atteindre mes objectifs."
        },

        "discover": {
            "title": "Découvrez-en plus",
            "description": "Ce n'est pas terminé, ce n'est que le début. Découvrez ce dont je suis capable en parcourant mon site !",

            "knowledge": {
                "title": "Explorez mes connaissances",
                "description": "Plongez dans les compétences et l'éducation que j'ai acquises au fil des années. Cette section met en lumière mes compétences techniques et l'étendue de mon parcours d'apprentissage.",
                "go_to_skills": "Voir mes compétences",
                "go_to_education": "Voir mon parcours scolaire"
            },

            "career": {
                "title": "Visualiser mon parcours",
                "description": "Découvrez mes expériences personnelles et professionnelles, mettant en avant les rôles que j'ai occupés et les projets auxquels j'ai contribué. Cette section offre un aperçu détaillé de mon cheminement de carrière.",
                "go_to_experiences": "Voir mes expériences"
            },

            "creations": {
                "title": "Découvrez mes créations",
                "description": "Explorez une collection de mes projets personnels et œuvres créatives. Du design au développement, cette galerie présente ma passion pour la création et l'innovation.",
                "go_to_gallery": "Voir mes réalisations"
            }
        }
    },

    "skills": {
        "title": "Compétences",
        "description": "Au fil des années, j'ai pu développer et acquérir de l'expérience dans une variété de compétences.",

        "it_skills": {
            "title": "Compétences Informatiques",
            "description": "Langages de programmation et outils que je maîtrise.",

            "languages": "Langages",
            "frameworks": "Frameworks",
            "tools": "Outils"
        },

        "soft_skills": {
            "title": "Savoir-être",
            "description": "Diverses compétences interpersonnelles acquises au cours des différents projets sur lesquels j'ai travaillé.",

            "motivation": {
                "title": "Motivation",
                "description": "Je suis très motivé dans tout ce que j'entreprends et j'aime explorer divers sujets."
            },

            "adaptation": {
                "title": "Adaptation",
                "description": "Je m'adapte facilement à différentes situations et je m'efforce toujours de donner le meilleur de moi-même."
            },

            "autonomy": {
                "title": "Autonomie",
                "description": "Principalement autodidacte, je sais être autonome pour atteindre mes objectifs."
            },

            "team_work": {
                "title": "Travail d'équipe",
                "description": "Je suis capable de collaborer et de respecter différents points de vue afin de contribuer activement aux objectifs du groupe."
            }
        }
    }

}